---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
source: html/46b15eb7-46c4-2ed9-df2d-417777518f18.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementLayerType

Describes the layers of an Area Reinforcement

## Syntax (C#)
```csharp
public enum AreaReinforcementLayerType
```